---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Architecture.TopRail
source: html/399b46a2-f131-e701-b580-04c2199a53e6.htm
---
# TopRail Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.